rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K37_FCCU.h
#define FCCU_NCF_CFG_NCFC7_MASK                  (0x80U)
#define FCCU_NCF_CFG_NCFC7_SHIFT                 (7U)
#define FCCU_NCF_CFG_NCFC7_WIDTH                 (1U)
#define FCCU_NCF_CFG_NCFC7(x)                    (((uint32_t)(((uint32_t)(x)) << FCCU_NCF_CFG_NCFC7_SHIFT)) & FCCU_NCF_CFG_NCFC7_MASK)

#define FCCU_NCF_CFG_NCFC8_MASK                  (0x100U)
#define FCCU_NCF_CFG_NCFC8_SHIFT                 (8U)
#define FCCU_NCF_CFG_NCFC8_WIDTH                 (1U)
#define FCCU_NCF_CFG_NCFC8(x)                    (((uint32_t)(((uint32_t)(x)) << FCCU_NCF_CFG_NCFC8_SHIFT)) & FCCU_NCF_CFG_NCFC8_MASK)

#define FCCU_NCF_CFG_NCFC9_MASK                  (0x200U)
#define FCCU_NCF_CFG_NCFC9_SHIFT                 (9U)
#define FCCU_NCF_CFG_NCFC9_WIDTH                 (1U)
#define FCCU_NCF_CFG_NCFC9(x)                    (((uint32_t)(((uint32_t)(x)) << FCCU_NCF_CFG_NCFC9_SHIFT)) & FCCU_NCF_CFG_NCFC9_MASK)

#define FCCU_NCF_CFG_NCFC10_MASK                 (0x400U)
#define FCCU_NCF_CFG_NCFC10_SHIFT                (10U)
#define FCCU_NCF_CFG_NCFC10_WIDTH                (1U)
#define FCCU_NCF_CFG_NCFC10(x)                   (((uint32_t)(((uint32_t)(x)) << FCCU_NCF_CFG_NCFC10_SHIFT)) & FCCU_NCF_CFG_NCFC10_MASK)

#define FCCU_NCF_CFG_NCFC11_MASK                 (0x800U)
#define FCCU_NCF_CFG_NCFC11_SHIFT                (11U)
#define FCCU_NCF_CFG_NCFC11_WIDTH                (1U)
#define FCCU_NCF_CFG_NCFC11(x)                   (((uint32_t)(((uint32_t)(x)) << FCCU_NCF_CFG_NCFC11_SHIFT)) & FCCU_NCF_CFG_NCFC11_MASK)

#define FCCU_NCF_CFG_NCFC12_MASK                 (0x1000U)
#define FCCU_NCF_CFG_NCFC12_SHIFT                (12U)
#define FCCU_NCF_CFG_NCFC12_WIDTH                (1U)
#define FCCU_NCF_CFG_NCFC12(x)                   (((uint32_t)(((uint32_t)(x)) << FCCU_NCF_CFG_NCFC12_SHIFT)) & FCCU_NCF_CFG_NCFC12_MASK)

#define FCCU_NCF_CFG_NCFC13_MASK                 (0x2000U)
#define FCCU_NCF_CFG_NCFC13_SHIFT                (13U)
#define FCCU_NCF_CFG_NCFC13_WIDTH                (1U)
#define FCCU_NCF_CFG_NCFC13(x)                   (((uint32_t)(((uint32_t)(x)) << FCCU_NCF_CFG_NCFC13_SHIFT)) & FCCU_NCF_CFG_NCFC13_MASK)

#define FCCU_NCF_CFG_NCFC14_MASK                 (0x4000U)
#define FCCU_NCF_CFG_NCFC14_SHIFT                (14U)
#define FCCU_NCF_CFG_NCFC14_WIDTH                (1U)
#define FCCU_NCF_CFG_NCFC14(x)                   (((uint32_t)(((uint32_t)(x)) << FCCU_NCF_CFG_NCFC14_SHIFT)) & FCCU_NCF_CFG_NCFC14_MASK)

#define FCCU_NCF_CFG_NCFC15_MASK                 (0x8000U)
#define FCCU_NCF_CFG_NCFC15_SHIFT                (15U)
#define FCCU_NCF_CFG_NCFC15_WIDTH                (1U)
#define FCCU_NCF_CFG_NCFC15(x)                   (((uint32_t)(((uint32_t)(x)) << FCCU_NCF_CFG_NCFC15_SHIFT)) & FCCU_NCF_CFG_NCFC15_MASK)
/*! @} */

/*! @name NCFS_CFG - Non-critical Fault-State Configuration */
/*! @{ */

#define FCCU_NCFS_CFG_NCFSC0_MASK                (0x3U)
#define FCCU_NCFS_CFG_NCFSC0_SHIFT               (0U)
#define FCCU_NCFS_CFG_NCFSC0_WIDTH               (2U)
#define FCCU_NCFS_CFG_NCFSC0(x)                  (((uint32_t)(((uint32_t)(x)) << FCCU_NCFS_CFG_NCFSC0_SHIFT)) & FCCU_NCFS_CFG_NCFSC0_MASK)

#define FCCU_NCFS_CFG_NCFSC1_MASK                (0xCU)
#define FCCU_NCFS_CFG_NCFSC1_SHIFT               (2U)
#define FCCU_NCFS_CFG_NCFSC1_WIDTH               (2U)
#define FCCU_NCFS_CFG_NCFSC1(x)                  (((uint32_t)(((uint32_t)(x)) << FCCU_NCFS_CFG_NCFSC1_SHIFT)) & FCCU_NCFS_CFG_NCFSC1_MASK)

#define FCCU_NCFS_CFG_NCFSC2_MASK                (0x30U)
#define FCCU_NCFS_CFG_NCFSC2_SHIFT               (4U)
#define FCCU_NCFS_CFG_NCFSC2_WIDTH               (2U)
#define FCCU_NCFS_CFG_NCFSC2(x)                  (((uint32_t)(((uint32_t)(x)) << FCCU_NCFS_CFG_NCFSC2_SHIFT)) & FCCU_NCFS_CFG_NCFSC2_MASK)

#define FCCU_NCFS_CFG_NCFSC3_MASK                (0xC0U)
#define FCCU_NCFS_CFG_NCFSC3_SHIFT               (6U)
#define FCCU_NCFS_CFG_NCFSC3_WIDTH               (2U)
#define FCCU_NCFS_CFG_NCFSC3(x)                  (((uint32_t)(((uint32_t)(x)) << FCCU_NCFS_CFG_NCFSC3_SHIFT)) & FCCU_NCFS_CFG_NCFSC3_MASK)

#define FCCU_NCFS_CFG_NCFSC4_MASK                (0x300U)
#define FCCU_NCFS_CFG_NCFSC4_SHIFT               (8U)
#define FCCU_NCFS_CFG_NCFSC4_WIDTH               (2U)
#define FCCU_NCFS_CFG_NCFSC4(x)                  (((uint32_t)(((uint32_t)(x)) << FCCU_NCFS_CFG_NCFSC4_SHIFT)) & FCCU_NCFS_CFG_NCFSC4_MASK)

#define FCCU_NCFS_CFG_NCFSC5_MASK                (0xC00U)
#define FCCU_NCFS_CFG_NCFSC5_SHIFT               (10U)
#define FCCU_NCFS_CFG_NCFSC5_WIDTH               (2U)
#define FCCU_NCFS_CFG_NCFSC5(x)                  (((uint32_t)(((uint32_t)(x)) << FCCU_NCFS_CFG_NCFSC5_SHIFT)) & FCCU_NCFS_CFG_NCFSC5_MASK)

#define FCCU_NCFS_CFG_NCFSC6_MASK                (0x3000U)
#define FCCU_NCFS_CFG_NCFSC6_SHIFT               (12U)
#define FCCU_NCFS_CFG_NCFSC6_WIDTH               (2U)
#define FCCU_NCFS_CFG_NCFSC6(x)                  (((uint32_t)(((uint32_t)(x)) << FCCU_NCFS_CFG_NCFSC6_SHIFT)) & FCCU_NCFS_CFG_NCFSC6_MASK)

#define FCCU_NCFS_CFG_NCFSC7_MASK                (0xC000U)
#define FCCU_NCFS_CFG_NCFSC7_SHIFT               (14U)
#define FCCU_NCFS_CFG_NCFSC7_WIDTH               (2U)
#define FCCU_NCFS_CFG_NCFSC7(x)                  (((uint32_t)(((uint32_t)(x)) << FCCU_NCFS_CFG_NCFSC7_SHIFT)) & FCCU_NCFS_CFG_NCFSC7_MASK)

#define FCCU_NCFS_CFG_NCFSC8_MASK                (0x30000U)
#define FCCU_NCFS_CFG_NCFSC8_SHIFT               (16U)
#define FCCU_NCFS_CFG_NCFSC8_WIDTH               (2U)
#define FCCU_NCFS_CFG_NCFSC8(x)                  (((uint32_t)(((uint32_t)(x)) << FCCU_NCFS_CFG_NCFSC8_SHIFT)) & FCCU_NCFS_CFG_NCFSC8_MASK)

#define FCCU_NCFS_CFG_NCFSC9_MASK                (0xC0000U)
#define FCCU_NCFS_CFG_NCFSC9_SHIFT               (18U)
#define FCCU_NCFS_CFG_NCFSC9_WIDTH               (2U)
#define FCCU_NCFS_CFG_NCFSC9(x)                  (((uint32_t)(((uint32_t)(x)) << FCCU_NCFS_CFG_NCFSC9_SHIFT)) & FCCU_NCFS_CFG_NCFSC9_MASK)

#define FCCU_NCFS_CFG_NCFSC10_MASK               (0x300000U)
#define FCCU_NCFS_CFG_NCFSC10_SHIFT              (20U)
#define FCCU_NCFS_CFG_NCFSC10_WIDTH              (2U)
#define FCCU_NCFS_CFG_NCFSC10(x)                 (((uint32_t)(((uint32_t)(x)) << FCCU_NCFS_CFG_NCFSC10_SHIFT)) & FCCU_NCFS_CFG_NCFSC10_MASK)

#define FCCU_NCFS_CFG_NCFSC11_MASK               (0xC00000U)
#define FCCU_NCFS_CFG_NCFSC11_SHIFT              (22U)
#define FCCU_NCFS_CFG_NCFSC11_WIDTH              (2U)
#define FCCU_NCFS_CFG_NCFSC11(x)                 (((uint32_t)(((uint32_t)(x)) << FCCU_NCFS_CFG_NCFSC11_SHIFT)) & FCCU_NCFS_CFG_NCFSC11_MASK)

#define FCCU_NCFS_CFG_NCFSC12_MASK               (0x3000000U)
#define FCCU_NCFS_CFG_NCFSC12_SHIFT              (24U)
#define FCCU_NCFS_CFG_NCFSC12_WIDTH              (2U)
#define FCCU_NCFS_CFG_NCFSC12(x)                 (((uint32_t)(((uint32_t)(x)) << FCCU_NCFS_CFG_NCFSC12_SHIFT)) & FCCU_NCFS_CFG_NCFSC12_MASK)

